data.org
#+HUGO_BASE_DIR: .

** CSS and JavaScript aren't byte code !! :rant:css:js:web:
   :PROPERTIES:
   :EXPORT_HUGO_SECTION: posts/
   :EXPORT_FILE_NAME: css-and-js-are-not-bytecode
   :EXPORT_DATE: 2016-09-21
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: aliases /post/css-and-js-are-not-bytecode
   :END:

#+BEGIN_QUOTE
  Disclaimer: I was a noob(literally) when I wrote it. I just didn't wanted to
  delete it as it was my first blog.
#+END_QUOTE

The earliest computers were often programmed without the help of a
programming language, by writing programs in absolute machine language.
The programs, in decimal or binary form (mostly binary),were read in
from punched cards or magnetic tape or toggled in on switches on the
front panel of the computer. I guess they started creating programming
languages in order to make it human readable. Then they developed
[[https://en.wikipedia.org/wiki/First-generation_programming_language][First
Gen]],
[[https://en.wikipedia.org/wiki/First-generation_programming_language][Assembly
languages]](/Ah..my first project/) and created something called
[[https://en.wikipedia.org/wiki/High-level_programming_language][
high-level programming language]].

But we didn't stop there, did we ? We had C,we got Python, a more
readable yet slow language.People wrote languages like Basic, Scratch,
Ruby to make things more simple and people loved it.Okay...We are there
now. Everything was going alright..perfect..superb in the IT Programming
industry until when some guys got really serious about JavaScript.I
guess that's the reason I am writing this blog now.

I was in college when I learned web developement. At that time Frontend
developers are not actually called developers but designers. I often
took my time off from those grumpy sorting algorithms and writing C and
used to geek off with these top three. *HTML*, *CSS* and
*JavaScript*.Well practically less JavaScript and more *jQuery*. They
were so addictive for a curious guy like me who used to draw his
imaginations on a 15.6 inch screen.Nobody really cared about JavaScript
back then...everyone was so focused on backend like php,asp,django and
hipster rails.

The space was completely occupied by JQuery with more readable and
easily writable syntax.Ajax implementation was easy, people don't have
to remember those =getElementById('blah..blah') = kinda functions.Coming
to CSS, writing CSS was absolutely fun until smaller devices came.
People needed better looking websites on their phone rather than
squeezed down version of websites.Hence designers started writing media
queries(/It took me a whole year to understand =@media queries=/) and
grids to make sites responsive.

*** *Is there any twist in this story..coz I'm getting bored !*
    :PROPERTIES:
    :CUSTOM_ID: is-there-any-twist-in-this-storycoz-im-getting-bored-
    :END:

Then a guy at [[https://twitter.com][Twitter]] developed a front-end
framework called Bootstrap and the whole world just started drooling
over it. It was awesome to use..developers don't had to waste a day to
design grids or write media queries.But the problem started when people
considered this anything more than a framework. Videos got published,
books got written to learn Bootstrap. Now a newbie has to learn
HTML,CSS,and Bootstrap instead of just the former two.

#+BEGIN_QUOTE
  So Instead of learning how these grids and navbar works, they just
  started using it.
#+END_QUOTE

Same thing also happened to JavaScript.People almost forgot that they
can really write an web app by just using pure HTML, CSS and
Javascript(/Now they are calling it Vanilla JavaScript/).There was
JQuery for quite sometime till angular came.People started using
JavaScript in backend,thanks to /node.js/. Then came /Vue.js/,
/Ember.js/, /Meteor.js/, /React.js/ and more. And surprisingly some of
them don't even use JavaScript, instead they use languages that
transpiles to JavaScript.

#+BEGIN_EXPORT HTML
  <!-- It's completely understandable when a lazy programmer(_Well all are lazy_) creates one such language so that he and his company don't have to write lengthy JavaScript all the time, why others are jumping there ditching the core language?? In countries like India,China people are following the same pattern where connectivity is not at it's best yet. -->
#+END_EXPORT

#+BEGIN_QUOTE
  See what happened to /Angular/..!! They rewrote the whole framework
  and created /Angular 2/. React JS is unstable like an active Volcano.
#+END_QUOTE

*** *What's your point man..Can't you be just happy*
    :PROPERTIES:
    :CUSTOM_ID: whats-your-point-mancant-you-be-just-happy
    :END:

I am not completely against it. All that's happening is good, I surely
have nothing against any X framework or Y library. Just teach the
newbies the basic first. They need to know both the pro's and con's of
any library or framework instead of the /"This framework is so cool..!!
coz that company backs it."/ trend.

*** *Adios*
    :PROPERTIES:
    :CUSTOM_ID: adios
    :END:

Inspired from this
[[https://hackernoon.com/how-it-feels-to-learn-javascript-in-2016-d3a717dd577f/][article]].
